# =============================================================================
# ОГОЛОШЕННЯ
# =============================================================================
# Формат cron: "хвилина година день_місяця місяць день_тижня"
#
#   0 9 * * 0-4     → 09:00 щодня пн-пт: (0 - пн.; 1 - вт.; 2 - ср.; 3 - чт.; 4 - пт)
#   0 17 * * 4      → 17:00 кожної п'ятниці
#   0 10 * * 0      → 10:00 кожного понеділка
#   */30 * * * *    → кожні 30 хвилин
#   0 9,18 * * *    → 09:00 і 18:00 щодня
#
# Часовий пояс: Europe/Kyiv
# chats: список ключів з CHATS у config.py, або ["all"] для всіх груп
# =============================================================================

from utils.utils import get_study_week, get_day_of_week


ANNOUNCEMENTS = [
    {
        # lambda — щоб текст обраховувався в момент надсилання, а не при старті
        "text": lambda: f"🔔 {get_day_of_week()} Доброго ранку! Навчаємося за розкладом {get_study_week()}-го тижня",
        "cron": "25 8 * * 0",        # 08:25 щопонеділка
        "chats": ["all"],
    },
    {
        "text": lambda: f"🌅 {get_day_of_week()} Доброго ранку! Гарного та продуктивного дня!",
        "cron": "25 8 * * 1-4",       # 08:25 вт-пт
        "chats": ["main"],
    },
    # {
    #     "text": "🌙 Завершуємо робочий день. Гарного вечора!",
    #     "cron": "0 18 * * 1-5",        # 18:00 пн-пт
    #     "chats": ["main"],
    # },
    # {
    #     "text": "📋 Нагадування: підготуйте звіт за тиждень.",
    #     "cron": "0 16 * * 5",        # 16:00 щоп'ятниці
    #     "chats": ["main"],
    # },
    {
        "text": "🕒 Нагадую, - вже 11.00", # [тестове внутрішнє повідомлення в особисті]
        "cron": "0 11 * * 1-5",      # 11:00 пн-пт
        "chats": ["dev"],
    },
    {
        "text": "Привіт! Особисте повідомлення для всіх користувачів",
        "cron": "0 8 * * 1",
        "chats": [],
        "users": ["all"],
    },
    {
        "text": "Привіт Ігор! Це повідомлення лише для тебе.",
        "cron": "0 15 * * 0-6",
        "chats": [],
        "users": ["Kryzhev"],
    },
    {
        "text": "Привіт Ігор або Андрій! Це повідомлення ти побачиш в особисті, але отримаєте це повідомлення ви обидва.",
        "cron": "30 14 35 * 0-6",
        "chats": [],
        "users": ["Kryzhev", "andriitramon"],
    },
    {
        "text": "Привіт @Ігор і @Андрій і чат. Це повідомлення має попасти в особисті кожному окремо та в груповий чат",
        "cron": "30 14 40 * 0-6",
        "chats": ["main"],
        "users": ["@Kryzhev", "@andriitramon"],
    },
    {
        "text": "Привіт Андірй! Це повідомлення тільки для тебе",
        "cron": "30 14 * * 0-6",
        "chats": [],
        "users": ["andriitramon"],
    },
]
